//寫一個程式找出一個 n 乘 m 的矩陣中大於上下左右相鄰元素的元素。
//輸入第一行為矩陣的列數 n 與行數 m ，以下 n 列每列有 m 個矩陣元
//素，輸出為大於其相鄰元素的元素。如果有一個以上這樣的元素，則輸
//出的順序是逐列輸出，每一列在逐行輸出。每個輸出元素佔一行。
//參數規範: 0 < n <= 100, 0 < m <= 100

#include <stdio.h>
main()
{
  int n, m, i, j, a[102][102] = {0};
  scanf("%d", &n);
  scanf("%d", &m);
  for(i = 0; i < n; i++)
    for(j = 0; j < m; j++)
      scanf("%d", &a[i][j]);

  for(i = 0; i < n; i++)
    for(j = 0; j < m; j++) {
      if(
        (a[i][j] > a[i - 1][j] || i == 0) &&
        (a[i][j] > a[i + 1][j] || i == n - 1) &&
        (a[i][j] > a[i][j - 1] || j == 0) &&
        (a[i][j] > a[i][j + 1] || j == m - 1)
      ) printf("%d\n", a[i][j]);
    }
}
  
